TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_pipe.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the REG_PARITY_CHECK register
//
//*************************************************************************************************
#define PIPE_REG_PARITY_CHECK_MODE_S   0U
#define PIPE_REG_PARITY_CHECK_MODE_M   0xFU          // Parity check mode
#define PIPE_REG_PARITY_CHECK_KEY_S    16U
#define PIPE_REG_PARITY_CHECK_KEY_M    0xFFFF0000U   // Key to enable write to lower [15:0] bit
                                                     // fields

//*************************************************************************************************
//
// The following are defines for the bit fields in the REG_PARITY_READ register
//
//*************************************************************************************************
#define PIPE_REG_PARITY_READ_PARITY_READ_EN_S   0U
#define PIPE_REG_PARITY_READ_PARITY_READ_EN_M   0xFU          // Parity read enable
#define PIPE_REG_PARITY_READ_KEY_S              16U
#define PIPE_REG_PARITY_READ_KEY_M              0xFFFF0000U   // Key to enable write to lower
                                                              // [15:0] bit fields

//*************************************************************************************************
//
// The following are defines for the bit fields in the INT_CTL_L register
//
//*************************************************************************************************
#define PIPE_INT_CTL_L_EN              0x1U   // INT enable
#define PIPE_INT_CTL_L_FLAG            0x2U   // INT FLAG status
#define PIPE_INT_CTL_L_OVERFLOW_FLAG   0x4U   // INT_OVERFLOW_FLAG status

//*************************************************************************************************
//
// The following are defines for the bit fields in the INT_CTL_H register
//
//*************************************************************************************************
#define PIPE_INT_CTL_H_FLAG_FRC            0x1U   // INT SW set bit
#define PIPE_INT_CTL_H_FLAG_CLR            0x2U   // INT_FLAG clear bit
#define PIPE_INT_CTL_H_OVERFLOW_FLAG_CLR   0x4U   // INT_OVERFLOW_FLAG clear bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the INT_CONFIG register
//
//*************************************************************************************************
#define PIPE_INT_CONFIG_PRI_LEVEL_S    0U
#define PIPE_INT_CONFIG_PRI_LEVEL_M    0xFFU      // Priority level
#define PIPE_INT_CONFIG_CONTEXT_ID_S   16U
#define PIPE_INT_CONFIG_CONTEXT_ID_M   0x30000U   // Interrupt Context-ID

//*************************************************************************************************
//
// The following are defines for the bit fields in the INT_LINK_OWNER register
//
//*************************************************************************************************
#define PIPE_INT_LINK_OWNER_OWNER_LINK_S   0U
#define PIPE_INT_LINK_OWNER_OWNER_LINK_M   0xFU     // Link owner for INT
#define PIPE_INT_LINK_OWNER_API_LINK_S     4U
#define PIPE_INT_LINK_OWNER_API_LINK_M     0xF0U    // Access protection inheritance link for INT
#define PIPE_INT_LINK_OWNER_API_LINK_EN    0x100U   // Access protection inheritance link enable
                                                    // for INT

//*************************************************************************************************
//
// The following are defines for the bit fields in the INT_LINK_OWNER_LFU register
//
//*************************************************************************************************
#define PIPE_INT_LINK_OWNER_LFU_OWNER_LINK_S   0U
#define PIPE_INT_LINK_OWNER_LFU_OWNER_LINK_M   0xFU     // Link owner for INT for LFU
#define PIPE_INT_LINK_OWNER_LFU_API_LINK_S     4U
#define PIPE_INT_LINK_OWNER_LFU_API_LINK_M     0xF0U    // Access protection inheritance link for
                                                        // INT for LFU
#define PIPE_INT_LINK_OWNER_LFU_API_LINK_EN    0x100U   // Access protection inheritance link
                                                        // enable for INT for LFU

//*************************************************************************************************
//
// The following are defines for the bit fields in the SELFTEST_DIAG_DATA1 register
//
//*************************************************************************************************
#define PIPE_SELFTEST_DIAG_DATA1_SELFTEST_DIAG_DATA1_S   0U
#define PIPE_SELFTEST_DIAG_DATA1_SELFTEST_DIAG_DATA1_M   0xFFFFFU   // Self test Diagnostics data 1

//*************************************************************************************************
//
// The following are defines for the bit fields in the SELFTEST_DIAG_ECC register
//
//*************************************************************************************************
#define PIPE_SELFTEST_DIAG_ECC_SELFTEST_DIAG_ECC_S   0U
#define PIPE_SELFTEST_DIAG_ECC_SELFTEST_DIAG_ECC_M   0x7FU   // Self test Diagnostics ECC

//*************************************************************************************************
//
// The following are defines for the bit fields in the SELFTEST_DIAG_CONTROL register
//
//*************************************************************************************************
#define PIPE_SELFTEST_DIAG_CONTROL_DIAG_TEST_EN_S      0U
#define PIPE_SELFTEST_DIAG_CONTROL_DIAG_TEST_EN_M      0xFU          // Diagnostic test enable
#define PIPE_SELFTEST_DIAG_CONTROL_DIAG_ECC_WIDTH_S    16U
#define PIPE_SELFTEST_DIAG_CONTROL_DIAG_ECC_WIDTH_M    0xF0000U      // Diagnostic ECC width
#define PIPE_SELFTEST_DIAG_CONTROL_DIAG_DATA_WIDTH_S   24U
#define PIPE_SELFTEST_DIAG_CONTROL_DIAG_DATA_WIDTH_M   0xFF000000U   // Diagnostic Data width

//*************************************************************************************************
//
// The following are defines for the bit fields in the SELFTEST_DIAG_STATUS register
//
//*************************************************************************************************
#define PIPE_SELFTEST_DIAG_STATUS_DIAG_TEST_DONE           0x2U      // Done self test
#define PIPE_SELFTEST_DIAG_STATUS_DIAG_TEST_FAIL           0x4U      // Test failed
#define PIPE_SELFTEST_DIAG_STATUS_DIAG_FAIL_C_ERROR        0x8U      // Diagnostic correctable
                                                                     // error
#define PIPE_SELFTEST_DIAG_STATUS_DIAG_FAIL_UC_ERROR       0x10U     // Diagnostic uncorrectable
                                                                     // error
#define PIPE_SELFTEST_DIAG_STATUS_DIAG_FAIL_CHECK_TYPE_S   5U
#define PIPE_SELFTEST_DIAG_STATUS_DIAG_FAIL_CHECK_TYPE_M   0x60U     // Failed diagnostic check
                                                                     // type
#define PIPE_SELFTEST_DIAG_STATUS_DIAG_FAIL_BIT_INDEX_S    8U
#define PIPE_SELFTEST_DIAG_STATUS_DIAG_FAIL_BIT_INDEX_M    0xFF00U   // Error bit position

//*************************************************************************************************
//
// The following are defines for the bit fields in the SELFTEST_DIAG_STATUS_CLR register
//
//*************************************************************************************************
#define PIPE_SELFTEST_DIAG_STATUS_CLR_DIAG_TEST_DONE   0x2U   // Clear self test done status flag
#define PIPE_SELFTEST_DIAG_STATUS_CLR_DIAG_TEST_FAIL   0x4U   // Clear test failed status flags



#endif
